renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/*
 * Copyright (C) 2016 Renesas Electronics Corporation and/or its affiliates
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * File Name    : r_ether_rx.c
 * Version      : 1.24
 * Description  : Ethernet module device driver
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 22.07.2014 1.00     First Release
 *         : 16.12.2014 1.01     Made changes related to header file include.
 *         : 27.03.2015 1.02     Changed the R_ETHER_LinkProcess() Function
 *         : 31.03.2016 1.10     Added changes for MCU which have single channel Ethernet controller.
 *         : 01.10.2016 1.11     Added changes for RX65N.
 *         : 11.11.2016 1.12     The module is updated to fix the software issue.
 *                               When R_ETHER_LinkProcess function is called, 
 *                               there are cases when link up/link down are not processed successfully.
 *                                 The issue occurs when ETHER_CFG_USE_LINKSTA is set to a value of 0.
 *                               Corrected source code of the R_ETHER_Close_ZC2 function.
 *                               Corrected source code of the R_ETHER_LinkProcess function.
 *         : 01.10.2017 1.13     Removed ether_clear_icu_source function in R_ETHER_Close_ZC2 function.
 *         : 07.05.2018 1.14     The module is updated to fix the software issues.
 *                               (1) When R_ETHER_Read_ZC2 function or R_ETHER_Read function is called,
 *                               there is case when the Ethernet frame cannot be received normally.
 *                                 The issue occurs when R_ETHER_Read_ZC2 function or R_ETHER_Read function
 *                                 is called in the interrupt function.
 *                               Corrected source code of the R_ETHER_LinkProcess function.
 *                               (2) When R_ETHER_LinkProcess function is called,
 *                               there is case when link up processing is not completed normally.
 *                                 The issue occurs When R_ETHER_LinkProcess function is called,
 *                                 PHY auto-negotiation is not completed.
 *                               Corrected source code of the R_ETHER_LinkProcess function.
 *                               (3) When R_ETHER_Read_ZC2 function or R_ETHER_Read function is called,
 *                               there is case when execution of function is not completed.
 *                                 The issue occurs when R_ETHER_LinkProcess function is called
 *                                 in the interrupt function.
 *                               Corrected source code of the R_ETHER_Read_ZC2 function.
 *         : 20.05.2019 1.16     Added support for GNUC and ICCRX.
 *                               Fixed coding style.
 *         : 30.07.2019 1.17     Added WAIT LOOP.
 *                               Added changes for RX72M.
 *                               The module is updated to fix the software issue.
 *                               When R_ETHER_Read_ZC2_BufRelease function and R_ETHER_Read function are executed,
 *                               data is received when the reception descriptor (RAM) operated by EDMAC and the 
 *                               reception descriptor (RAM) operated by Ether FIT module are the same. There may occur  
 *                               two phenomena:
 *                               (1) Data loss for one frame of received data may occur.
 *                               (2) Also, even if no data loss occurs, if an error frame is received, it may be 
 *                                   erroneously recognized as a normal frame.
 *         : 22.11.2019 1.20     The module is updated to solve the following problem.
 *                               (1) Added changes for RX72N.
 *                               (2) Added changes for RX66N.
 *                               (3) Changed R_ETHER_Initial, R_ETHER_Open_ZC2, R_ETHER_Close_ZC2, R_ETHER_CheckLink_ZC,
 *                                   R_ETHER_LinkProcess, R_ETHER_WakeOnLAN, R_ETHER_Control for NON-BLOCKING.
 *                               (4) Added ether_set_pmgi_callback, get_pmgi_channel, pmgi_open_zc2_step0,  
 *                                   pmgi_open_zc2_step1, pmgi_open_zc2_step2, pmgi_open_zc2_step3, pmgi_open_zc2_step4, 
 *                                   pmgi_open_zc2_step5, pmgi_open_zc2_step6, pmgi_checklink_zc_step0,
 *                                   pmgi_checklink_zc_step1, pmgi_linkprocess_step0,pmgi_linkprocess_step1, 
 *                                   pmgi_linkprocess_step2, pmgi_wakeonlan_step0, pmgi_wakeonlan_step1,
 *                                   pmgi_wakeonlan_step2, pmgi_writephy_step0, pmgi_readphy_step0, pmgi_modestep_invalid, 
 *                                   R_ETHER_WritePHY, R_ETHER_ReadPHY, ether_pmgi0i_isr, ether_pmgi1i_isr, set_ether_channel
 *                                   for NON-BLOCKING.
 *                               (5) Added PmgiAccessFun_tbl for NON-BLOCKING.
 *                               (6) Added local_advertise, g_local_pause_bits, g_phy_current_param for NON-BLOCKING.
 *                               (7) Changed R_ETHER_Initial, R_ETHER_Control, ether_config_ethernet for insert padding 
 *                                   into received data.
 *                               (8) Added ether_receive_data_padding for insert padding into received data.
 *                               (9) Added padding_insert_position and padding_insert_size for insert padding into 
 *                                   received data.
 *                               (10) Added support for atomic control. 
 *         : 20.11.2021 1.22     Correction of ETHER_CFG_USE_PHY_ICS1894_32.
 *         : 20.03.2025 1.24     Changed the disclaimer in program sources
 ***********************************************************************************************************************/

