renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/*
 * Renesas Ethernet API functions
 */
/**********************************************************************************************************************
 * Function Name: R_ETHER_Initial
 *****************************************************************************************************************/ /**
 * @brief     This function makes initial settings to the Ethernet FIT module.
 * @retval    None.
 * @details   Initializes the memory to be used in order to start Ethernet communication.
 * @note      This function must be called before calling the R_ETHER_Open_ZC2() function.
 */
void R_ETHER_Initial(void)
{
    /* Initialize the transmit and receive descriptor */
    memset((void *)&rx_descriptors, 0x00, sizeof(rx_descriptors));
    memset((void *)&tx_descriptors, 0x00, sizeof(tx_descriptors));

    /* Initialize the Ether buffer */
    memset(&ether_buffers, 0x00, sizeof(ether_buffers));

    memset(etherc_edmac_power_cont, 0x00, sizeof(etherc_edmac_power_cont));

    /* Initialize the callback function pointer */
    cb_func.pcb_func = NULL;

    /* Initialize the interrupt handler pointer */
    cb_func.pcb_int_hnd = NULL;

    /* Initialize the PMGI callback function pointer */
    cb_func.pcb_pmgi_hnd = NULL;

    /* Initialize */
#if (ETHER_CHANNEL_MAX == 1)
    promiscuous_mode[ETHER_CHANNEL_0] = ETHER_PROMISCUOUS_OFF;
    mc_filter_flag[ETHER_CHANNEL_0] = ETHER_MC_FILTER_OFF;
    bc_filter_count[ETHER_CHANNEL_0] = 0;
    padding_insert_position[ETHER_CHANNEL_0] = 0;
    padding_insert_size[ETHER_CHANNEL_0] = 0;
#elif (ETHER_CHANNEL_MAX == 2)
    promiscuous_mode[ETHER_CHANNEL_0] = ETHER_PROMISCUOUS_OFF;
    promiscuous_mode[ETHER_CHANNEL_1] = ETHER_PROMISCUOUS_OFF;
    mc_filter_flag[ETHER_CHANNEL_0] = ETHER_MC_FILTER_OFF;
    mc_filter_flag[ETHER_CHANNEL_1] = ETHER_MC_FILTER_OFF;
    bc_filter_count[ETHER_CHANNEL_0] = 0;
    bc_filter_count[ETHER_CHANNEL_1] = 0;
    padding_insert_position [ETHER_CHANNEL_0] = 0;
    padding_insert_position [ETHER_CHANNEL_1] = 0;
    padding_insert_size [ETHER_CHANNEL_0] = 0;
    padding_insert_size [ETHER_CHANNEL_1] = 0;
#endif
#if (ETHER_CFG_NON_BLOCKING == 1)
#if (PMGI_CHANNEL_MAX == 1)
    g_phy_current_param[PMGI_CHANNEL_0].locked.lock = false;
    g_phy_current_param[PMGI_CHANNEL_0].event = PMGI_IDLE;
    g_phy_current_param[PMGI_CHANNEL_0].mode = OPEN_ZC2;
    g_phy_current_param[PMGI_CHANNEL_0].step = STEP0;
    g_phy_current_param[PMGI_CHANNEL_0].read_data = 0;
    g_phy_current_param[PMGI_CHANNEL_0].reset_counter = 0;
#elif (ETHER_CHANNEL_MAX == 2)
    g_phy_current_param[PMGI_CHANNEL_0].locked.lock = false;
    g_phy_current_param[PMGI_CHANNEL_0].event = PMGI_IDLE;
    g_phy_current_param[PMGI_CHANNEL_0].mode = OPEN_ZC2;
    g_phy_current_param[PMGI_CHANNEL_0].step = STEP0;
    g_phy_current_param[PMGI_CHANNEL_0].read_data = 0;
    g_phy_current_param[PMGI_CHANNEL_0].reset_counter = 0;
    g_phy_current_param[PMGI_CHANNEL_1].locked.lock = false;
    g_phy_current_param[PMGI_CHANNEL_1].event = PMGI_IDLE;
    g_phy_current_param[PMGI_CHANNEL_1].mode = OPEN_ZC2;
    g_phy_current_param[PMGI_CHANNEL_1].step = STEP0;
    g_phy_current_param[PMGI_CHANNEL_1].read_data = 0;
    g_phy_current_param[PMGI_CHANNEL_1].reset_counter = 0;
#endif
#endif

} /* End of function R_ETHER_Initial() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Open_ZC2
 *****************************************************************************************************************/ /**
 * @brief     When using the ETHER API, this function is used first.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[in] mac_addr
 *             Specifies the MAC address of ETHERC.
 * @param[in] pause
 *             Specifies the value set in bit 10 (Pause) in register 4 (auto-negotiation advertisement)
 *             of the PHY-LSI. The setting ETHER_FLAG_ON is possible only when the user's PHY-LSI supports
 *             the pause function. This value is passed to the other PHY-LSI during auto-negotiation.
 *             Flow control is enabled if the auto-negotiation result indicates that both the local PHY-LSI
 *             and the other PHY-LSI support the pause function.\n
 *             Specify ETHER_FLAG_ON to convey that the pause function is supported to the other PHY-LSI
 *             during auto-negotiation, and specify ETHER_FLAG_OFF if the pause function is not supported
 *             or will not be used even though it is supported.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully or the PMGI operation start normally when the non-blocking mode
 *              is enable.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_INVALID_DATA
 *            - Value of the argument is out of range.
 * @retval    ETHER_ERR_OTHER
 *            - PHY-LSI initialization failed when the non-blocking mode is enabled and PMGI callback function is
 *              not registered .
 * @retval    ETHER_ERR_LOCKED
 *            - When PHY access is in progress when non-blocking mode is enabled .
 * @details   The R_ETHER_Open_ZC2() function resets the ETHERC, EDMAC and PHY-LSI by software, and starts PHY-LSI
 *            auto-negotiation to enable the link signal change interrupt.\n
 *            The MAC address is used to initialize the ETHERC MAC address register.\n
 *            When non-blocking mode is enabled, the processing result of the function is passed as an argument of
 *            the PMGI callback function.
 * @note      Either after the R_ETHER_initial() function is called immediately following a power-on reset,
 *            or after the R_ETHER_Close_ZC2() function was called, applications should only use the other
 *            API functions after first calling this function and verifying that the return value is ETHER_SUCCESS.
 */
ether_return_t R_ETHER_Open_ZC2(uint32_t channel, const uint8_t mac_addr[], uint8_t pause)
{
    volatile bsp_int_err_t bsp_int_err;
#if (ETHER_CFG_NON_BLOCKING == 0)
    const ether_control_t * pether_ch;
    uint32_t phy_access;
    ether_return_t ret;
    int16_t phy_ret;
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
#else
    uint16_t pmgi_channel;
    pmgi_cb_arg_t pmgi_cb_arg;
#endif

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == mac_addr) || (FIT_NO_PTR == mac_addr))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((ETHER_FLAG_OFF != pause) && (ETHER_FLAG_ON != pause))
    {
        return ETHER_ERR_INVALID_DATA;
    }

#if (ETHER_CFG_NON_BLOCKING == 1)
    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return ETHER_ERR_OTHER;
    }

    pmgi_channel = get_pmgi_channel(channel);

