renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    /* When the Link up processing is completed */
    else
    {
        ret = ETHER_NO_DATA;
        complete_flag = ETHER_ERR_OTHER;
#if (1 == ETHER_CFG_EMAC_RX_DESCRIPTORS)
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;
#endif
        /* WAIT_LOOP */
        while (ETHER_SUCCESS != complete_flag)
        {
#if (1 == ETHER_CFG_EMAC_RX_DESCRIPTORS)
            /* When receive function enable  */
            if (0x00000000L == pedmac_adr->EDRRR.LONG)
#else
            /* When receive data exists. */
            if (RACT != (papp_rx_desc[channel]->status & RACT))
#endif
            {
                /* Check multicast is detected when multicast frame filter is enabled */
                if (ETHER_MC_FILTER_ON == mc_filter_flag[channel])
                {
                    if (RFS7_RMAF == (papp_rx_desc[channel]->status & RFS7_RMAF))
                    {
                        /* The buffer is released at the multicast frame detect.  */
                        ret2 = R_ETHER_Read_ZC2_BufRelease(channel);
                        if (ETHER_SUCCESS != ret2)
                        {
                            return ret2;
                        }

                        ret = ETHER_ERR_MC_FRAME;
                        complete_flag = ETHER_SUCCESS;
                    }
                }

                if (ETHER_ERR_MC_FRAME != ret)
                {
                    if (RFE == (papp_rx_desc[channel]->status & RFE))
                    {
                        /* The buffer is released at the error.  */
                        ret2 = R_ETHER_Read_ZC2_BufRelease(channel);
                        if (ETHER_SUCCESS != ret2)
                        {
                            return ret2;
                        }
                    }
                    else
                    {
                        /**
                         * Pass the pointer to received data to application.  This is
                         * zero-copy operation.
                         */
                        (*pbuf) = (void *) papp_rx_desc[channel]->buf_p;

                        /* Get bytes received */
                        num_recvd = papp_rx_desc[channel]->size;
                        ret = num_recvd;
                        complete_flag = ETHER_SUCCESS;
                    }
                }
            }
            else
            {
                ret = ETHER_NO_DATA;
                complete_flag = ETHER_SUCCESS;
            }
        }
    }
    return ret;
} /* End of function R_ETHER_Read_ZC2() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Read_ZC2_BufRelease
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Read_ZC2_BufRelease() function releases the buffer read by the R_ETHER_Read_ZC2() function.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @details   The R_ETHER_Read_ZC2_BufRelease() function releases the buffer read by the R_ETHER_Read_ZC2() function.
 * @note      Before calling this function, use the R_ETHER_Read_ZC2 function to read data. Call this function after
 *            a value of 1 or greater is returned.\n
 *            This function is used in combination with the R_ETHER_Read_ZC2_BufRelease function.
 *            Always call the R_ETHER_Read_ZC2 function and then the R_ETHER_Read_ZC2_BufRelease function in sequence.
 *            If the value ETHER_ERR_LINK is returned when this function is called, initialize the Ethernet FIT module.
 */
int32_t R_ETHER_Read_ZC2_BufRelease(uint32_t channel)
{
    int32_t ret;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
    uint32_t status;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (1 == check_mpde_bit())

    {
        ret = ETHER_ERR_MPDE;
    }

    /* When the Link up processing is completed */
    else
    {
#if (1 == ETHER_CFG_EMAC_RX_DESCRIPTORS)
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;
#endif
        /* When receive data exists */
#if (1 == ETHER_CFG_EMAC_RX_DESCRIPTORS)
        if (0x00000000L == pedmac_adr->EDRRR.LONG)
#else
        if (RACT != (papp_rx_desc[channel]->status & RACT))
#endif
        {
            /* Move to next descriptor */

            status = RFP1;
            status |= RFP0;
            status |= RFE;
            status |= RFS9_RFOVER;
            status |= RFS8_RAD;
            status |= RFS7_RMAF;
            status |= RFS4_RRF;
            status |= RFS3_RTLF;
            status |= RFS2_RTSF;
            status |= RFS1_PRE;
            status |= RFS0_CERF;

            papp_rx_desc[channel]->status &= (~status);
            papp_rx_desc[channel]->status |= RACT;
            papp_rx_desc[channel] = papp_rx_desc[channel]->next;
        }
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;

        if (0x00000000L == pedmac_adr->EDRRR.LONG)
        {
            /* Restart if stopped */
            pedmac_adr->EDRRR.LONG = 0x00000001L;
        }

        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_Read_ZC2_BufRelease() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Write_ZC2_GetBuf
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Write_ZC2_GetBuf() function returns a pointer to the starting address of
 *            the transmit data destination.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[out] **pbuf
 *             Returns a pointer to the starting address of the transmit data destination.
 * @param[out] *pbuf_size
 *             Returns the maximum size to write to the buffer.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @retval    ETHER_ERR_TACT
 *            - Transmit buffer is not empty.
 * @details   The R_ETHER_Write_ZC2_GetBuf() function returns the parameter pbuf containing a pointer to
 *            the starting address of the transmit data destination. The function also returns the maximum size to
 *            write to the buffer to the parameter pbuf_size. Returning the pointer allows the operation to
 *            be performed with zero-copy.\n
 *            Return values indicate if the transmit buffer (pbuf) is writable or not. ETHER_SUCCESS is returned
 *            when the buffer is writable at the time of the call. When auto-negotiation is not completed,
 *            and transmission is not enabled, ETHER_ERR_LINK is returned. ETHER_ERR_MPDE is returned when
 *            a Magic Packet is being detected. ETHER_ERR_TACT is returned when the transmit buffer is not empty.\n
 *            The EDMAC hardware operates independent of the R_ETHER_Write_ZC2_GetBuf() function and writes data
 *            stored in a buffer pointed by the EDMAC transmit descriptor. The buffer pointed by the EDMAC
 *            transmit descriptor is statically allocated by the driver.
 * @note      This function is used in combination with the R_ETHER_Write_ZC2_SetBuf function.
 *            Always call the R_ETHER_Write_ZC2_GetBuf function and then the R_ETHER_Write_ZC2_SetBuf function
 *            in sequence. If the value ETHER_ERR_LINK is returned when this function is called,
 *            initialize the Ethernet FIT module.
 */
ether_return_t R_ETHER_Write_ZC2_GetBuf(uint32_t channel, void **pbuf, uint16_t *pbuf_size)
{
    ether_return_t ret;
#if (1 == ETHER_CFG_EMAC_TX_DESCRIPTORS)
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
#endif

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((NULL == pbuf_size) || (FIT_NO_PTR == pbuf_size))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (1 == check_mpde_bit())
    {
        ret = ETHER_ERR_MPDE;
    }

