renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS_OPEN_ZC2;
        g_phy_current_param[pmgi_channel].step = STEP0;

        g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

        pmgi_access(channel, PHY_REG_CONTROL, PHY_CONTROL_RESET, PMGI_WRITE);
        return;

#elif (ETHER_CFG_NON_BLOCKING == 0)
        R_ETHER_Open_ZC2(channel, mac_addr_buf[channel], pause_frame_enable[channel]);
#endif
    }

#if (ETHER_CFG_USE_LINKSTA == 0)
    #if (ETHER_CFG_NON_BLOCKING == 1)
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC0;
        g_phy_current_param[pmgi_channel].step = STEP0;

        pmgi_access(channel, PHY_REG_STATUS, reg_data, PMGI_READ);
        return ;

    #elif (ETHER_CFG_NON_BLOCKING == 0)
        ret = R_ETHER_CheckLink_ZC(channel);
        if (g_pre_link_stat[channel] != ret)
        {
            if (ret == ETHER_SUCCESS)
            {
                /* The state of the link status in PHY-LSI is confirmed and Link Up/Down is judged. */
                /* When becoming Link up */
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
            }
            else
            {
                /* When becoming Link down */
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_OFF;
            }
        }
        g_pre_link_stat[channel] = ret;
    #endif
#endif

    /* When the link is up */
    if (ETHER_FLAG_ON_LINK_ON == lchng_flag[channel])
    {
#if (ETHER_CFG_USE_LINKSTA == 1)
        /* 
         * The Link Up/Down is confirmed by the Link Status bit of PHY register1, 
         * because the LINK signal of PHY-LSI is used for LED indicator, and 
         * isn't used for notifing the Link Up/Down to external device.
         */
    #if (ETHER_CFG_NON_BLOCKING == 1)
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC1;
        g_phy_current_param[pmgi_channel].step = STEP0;

        pmgi_access(channel, PHY_REG_STATUS, reg_data, PMGI_READ);
        return ;
    #elif (ETHER_CFG_NON_BLOCKING == 0)
        ret = R_ETHER_CheckLink_ZC(channel);
        if (ETHER_SUCCESS == ret)
        {
            /*
             * The status of the LINK signal became "link-up" even if PHY-LSI did not detect "link-up"
             * after a reset. To avoid this wrong detection, processing in R_ETHER_LinkProcess has been modified to
             * clear the flag after link-up is confirmed in R_ETHER_CheckLink_ZC.
             */
            lchng_flag[channel] = ETHER_FLAG_OFF;

            /* Initialize the transmit and receive descriptor */
            memset((void *)&rx_descriptors[channel], 0x00, sizeof(rx_descriptors[channel]));
            memset((void *)&tx_descriptors[channel], 0x00, sizeof(tx_descriptors[channel]));

            /* Initialize the Ether buffer */
            memset(&ether_buffers[channel], 0x00, sizeof(ether_buffers[channel]));

            transfer_enable_flag[channel] = ETHER_FLAG_ON;
            
            /*
             * ETHERC and EDMAC are set after ETHERC and EDMAC are reset in software
             * and sending and receiving is permitted. 
             */
            ether_configure_mac(channel, mac_addr_buf[channel], NO_USE_MAGIC_PACKET_DETECT);
            ret = ether_do_link(channel, NO_USE_MAGIC_PACKET_DETECT);
            if (ETHER_SUCCESS == ret)
            {
                if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
                {
                    cb_arg.channel = channel;
                    cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_ON;
                    (*cb_func.pcb_func)((void *) &cb_arg);
                }
            }
            else
            {
                /* When PHY auto-negotiation is not completed */
                transfer_enable_flag[channel] = ETHER_FLAG_OFF;
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
            }
        }
        else
        {
            /* no process */
        }
    #endif /* (ETHER_CFG_NON_BLOCKING == 1) */
#elif ((ETHER_CFG_USE_LINKSTA == 0) && (ETHER_CFG_NON_BLOCKING == 0))
        /*
        * The status of the LINK signal became "link-up" even if PHY-LSI did not detect "link-up"
        * after a reset. To avoid this wrong detection, processing in R_ETHER_LinkProcess has been modified to
        * clear the flag after link-up is confirmed in R_ETHER_CheckLink_ZC.
        */
        lchng_flag[channel] = ETHER_FLAG_OFF;

        /* Initialize the transmit and receive descriptor */
        memset((void *)&rx_descriptors[channel], 0x00, sizeof(rx_descriptors[channel]));
        memset((void *)&tx_descriptors[channel], 0x00, sizeof(tx_descriptors[channel]));

        /* Initialize the Ether buffer */
        memset(&ether_buffers[channel], 0x00, sizeof(ether_buffers[channel]));

        transfer_enable_flag[channel] = ETHER_FLAG_ON;

        /*
        * ETHERC and EDMAC are set after ETHERC and EDMAC are reset in software
        * and sending and receiving is permitted. 
        */
        ether_configure_mac(channel, mac_addr_buf[channel], NO_USE_MAGIC_PACKET_DETECT);
        ret = ether_do_link(channel, NO_USE_MAGIC_PACKET_DETECT);
        if (ETHER_SUCCESS == ret)
        {
            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_ON;
                (*cb_func.pcb_func)((void *) &cb_arg);
            }
        }
        else
        {
            /* When PHY auto-negotiation is not completed */
            transfer_enable_flag[channel] = ETHER_FLAG_OFF;
            lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
        }
#endif /* (ETHER_CFG_USE_LINKSTA == 1) */
    }

    /* When the link is down */
    else if (ETHER_FLAG_ON_LINK_OFF == lchng_flag[channel])
    {
        lchng_flag[channel] = ETHER_FLAG_OFF;

#if (ETHER_CFG_USE_LINKSTA == 1)
        /* 
         * The Link Up/Down is confirmed by the Link Status bit of PHY register1, 
         * because the LINK signal of PHY-LSI is used for LED indicator, and 
         * isn't used for notifying the Link Up/Down to external device.
         */
    #if (ETHER_CFG_NON_BLOCKING == 1)
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC2;
        g_phy_current_param[pmgi_channel].step = STEP0;

