renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
        pmgi_access(channel, PHY_REG_STATUS, reg_data, PMGI_READ);
        return ;
    #elif (ETHER_CFG_NON_BLOCKING == 0)
        ret = R_ETHER_CheckLink_ZC(channel);
        if (ETHER_ERR_OTHER == ret)
        {
            pether_ch = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            petherc_adr = pether_ch[phy_access].petherc;

            /* Disable receive and transmit. */
            petherc_adr->ECMR.BIT.RE = 0;
            petherc_adr->ECMR.BIT.TE = 0;

            transfer_enable_flag[channel] = ETHER_FLAG_OFF;

            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_OFF;
                (*cb_func.pcb_func)((void *) &cb_arg);
            }
        }
        else
        {
            ; /* no operation */
        }
    #endif
#elif ((ETHER_CFG_USE_LINKSTA == 0) && (ETHER_CFG_NON_BLOCKING == 0))
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        petherc_adr = pether_ch[phy_access].petherc;

        /* Disable receive and transmit. */
        petherc_adr->ECMR.BIT.RE = 0;
        petherc_adr->ECMR.BIT.TE = 0;

        transfer_enable_flag[channel] = ETHER_FLAG_OFF;

        if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
        {
            cb_arg.channel = channel;
            cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_OFF;
            (*cb_func.pcb_func)((void *) &cb_arg);
        }
#endif
    }
    else
    {
#if (ETHER_CFG_NON_BLOCKING == 1)
        pmgi_close(pmgi_channel);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_IDLE;
            pmgi_cb_arg.mode = LINKPROCESS;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
#endif
        /* no operation */
    }
} /* End of function R_ETHER_LinkProcess() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_WakeOnLAN
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_WakeOnLAN() function switches the ETHERC setting from normal transmission/reception
 *            to Magic Packet detection.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully or the PMGI operation start normally when the non-blocking mode
 *              is enable.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_OTHER
 *            - A switch to magic packet detection was performed when the link state was link is down.
 *              Or the non-blocking mode is enabled and the interrupt handler function is not registered.
 * @retval    ETHER_ERR_LOCKED
 *            - When PHY access is in progress when non-blocking mode is enabled.
 * @details   The R_ETHER_WakeOnLAN() function initializes the ETHERC and EDMAC,
 *            and then switches the ETHERC to Magic Packet detection.\n
 *            If non-blocking call is disabled, return values indicate whether the ETHERC has been switched
 *            to Magic Packet detection or not. When auto-negotiation is not completed,
 *            and transmission/reception is not enabled, ETHER_ERR_LINK is returned.
 *            ETHER_ERR_OTHER is returned if the link is down after ETHERC is set to Magic Packet detection.\n
 *            When non-blocking mode is enabled, the processing result of the function is passed as
 *            an argument of the PMGI callback function.
 * @note      None.
 */
ether_return_t R_ETHER_WakeOnLAN(uint32_t channel)
{
#if (ETHER_CFG_USE_LINKSTA == 1 && ETHER_CFG_NON_BLOCKING == 0)
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
#endif
    ether_return_t ret;

#if (ETHER_CFG_NON_BLOCKING == 1)
    uint16_t reg_data = 0;
    uint16_t pmgi_channel;
    pmgi_cb_arg_t pmgi_cb_arg;
#endif

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

#if (ETHER_CFG_NON_BLOCKING == 1)
    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return ETHER_ERR_OTHER;
    }

    pmgi_channel = get_pmgi_channel(channel);

    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE *)&g_phy_current_param[pmgi_channel].locked))
    {
        return ETHER_ERR_LOCKED;
    }

    set_ether_channel(channel);

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_ERROR;
            pmgi_cb_arg.mode = WAKEONLAN;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
        return ETHER_ERR_OTHER;
    }
#endif

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
#if (ETHER_CFG_NON_BLOCKING == 1)
        pmgi_close(pmgi_channel);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_IDLE;
            pmgi_cb_arg.mode = WAKEONLAN;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
#endif
    }
    /* When the Link up processing is completed */
    else
    {
        /* Change to the magic packet detection mode.  */
        ether_configure_mac(channel, mac_addr_buf[channel], USE_MAGIC_PACKET_DETECT);
#if (ETHER_CFG_NON_BLOCKING == 1)
        g_phy_current_param[pmgi_channel].mode = WAKEONLAN;
        g_phy_current_param[pmgi_channel].step = STEP0;

