renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
        pmgi_access(channel, PHY_REG_STATUS, reg_data, PMGI_READ);

        return ETHER_SUCCESS;
#elif (ETHER_CFG_NON_BLOCKING == 0)
        ret = ether_do_link(channel, USE_MAGIC_PACKET_DETECT);
        if (ETHER_SUCCESS == ret)
        {
    #if (ETHER_CFG_USE_LINKSTA == 1)
            pether_ch = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            petherc_adr = pether_ch[phy_access].petherc;

            /* It is confirmed not to become Link down while changing the setting. */
            if (ETHER_CFG_LINK_PRESENT == petherc_adr->PSR.BIT.LMON)
            {
                ret = ETHER_SUCCESS;
            }
            else
            {
                ret = ETHER_ERR_OTHER;
            }
    #else
            /* It is confirmed not to become Link down while changing the setting. */
            ret = R_ETHER_CheckLink_ZC(channel);
    #endif
        }
        else
        {
            ret = ETHER_ERR_OTHER;
        }
#endif
    }
    return ret;
} /* End of function R_ETHER_WakeOnLAN() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Read
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Read() function receives data into the specified receive buffer.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[out] *pbuf
 *             Specifies the receive buffer (to store the receive data).\n
 *             The maximum write size is 1,514 bytes. When calling this function,
 *             specify the start address of a array with a capacity of 1,514 bytes.
 * @retval    A value of 1 or greater
 *            - Returns the number of bytes received.
 * @retval    ETHER_NO_DATA
 *            - A zero value indicates no data is received.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @retval    ETHER_ERR_MC_FRAME
 *            - Multicast frame detected when multicast frame filtering is enabled.
 * @details   This function stores the receive data in the specified receive buffer.\n
 *            Return values indicate the number of bytes received. If there is no data available at the time
 *            of the call, ETHER_NO_DATA is returned. When auto-negotiation is not completed,
 *            and reception is not enabled, ETHER_ERR_LINK is returned. ETHER_ERR_MPDE is returned
 *            when a Magic Packet is being detected.\n
 *            When multicast frame filtering on the specified channel is enabled by the R_ETHER_Control function,
 *            the buffer is released immediately when a multicast frame is detected.
 *            Also, the value ETHER_ERR_MC_FRAME is returned.
 *            Note that when hardware-based multicast frame filtering is enabled on the RX64M, RX71M, RX72M,
 *            RX72N or RX66N, multicast frames are discarded by the hardware and detection is not possible.\n
 *            Frames that generate a receive FIFO overflow, residual-bit frame receive error,
 *            long frame receive error, short frame receive error, PHY-LSI receive error, or receive frame
 *            CRC error are treated as receive frame errors. When a receive frame error occurs,
 *            the descriptor data is discarded, the status is cleared, and reading of data continues.
 * @note      1.As this function calls the R_ETHER_Read_ZC2() function and the R_ETHER_Read_ZC2_BufRelease()
 *              function internally, data is copied between the buffer pointed by the EDMAC receive descriptor
 *              and the receive buffer specified by the R_ETHER_Read() function. (The maximum write size is
 *              1,514 bytes, so set aside a space of 1,514 bytes for the specified receive buffer.)\n
 *            2.Make sure not to use the R_ETHER_Read_ZC2() function and R_ETHER_Read_ZC2_BufRelease()
 *              function when using the R_ETHER_Read() function.\n
 *            3.This function uses the standard function memcpy, so string.h is included.\n
 *            4.If the value ETHER_ERR_LINK is returned when this function is called,
 *              initialize the Ethernet FIT module.
 */
int32_t R_ETHER_Read(uint32_t channel, void *pbuf)
{
    int32_t ret;
    int32_t ret2;
    uint8_t * pread_buffer_address; /* Buffer location controlled by the Ethernet driver */

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* (1) Retrieve the receive buffer location controlled by the  descriptor. */
    ret = R_ETHER_Read_ZC2(channel, (void **) &pread_buffer_address);

    /* When there is data to receive */
    if (ret > ETHER_NO_DATA)
    {
        /* (2) Copy the data read from the receive buffer which is controlled by the descriptor to
         the buffer which is specified by the user (up to 1024 bytes). */
        memcpy(pbuf, pread_buffer_address, (uint32_t)ret);

        /* (3) Read the receive data from the receive buffer controlled by the descriptor,
         and then release the receive buffer. */
        ret2 = R_ETHER_Read_ZC2_BufRelease(channel);

        if (ETHER_SUCCESS == ret2) /* When this function is completed successfully */
        {
            /* Do Nothing */
        }

        /* Overwrite the error information */
        else
        {
            ret = ret2;
        }
    }

    /* When there is no data to receive */
    else
    {
        /* Do Nothing */
    }
    return ret;
} /* End of function R_ETHER_Read() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Write
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Write() function transmits the data from the specified transmit buffer.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[in] *pbuf
 *             Specifies the transmit data (the destination for the transmit data to be written).
 * @param[in] len
 *             Specifies the size (60 to 1,514 bytes) which is the Ethernet frame length minus 4 bytes of CRC.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_DATA
 *            - Value of the argument is out of range.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @retval    ETHER_ERR_TACT
 *            - Transmit buffer is not empty.
 * @details   This function transmits data from the specified transmit buffer.\n
 *            Set the buffer length to be not less than 60 bytes (64 bytes of the minimum Ethernet frame
 *            minus 4 bytes of CRC) and not more than 1,514 bytes (1,518 bytes of the maximum Ethernet frame
 *            minus 4 bytes of CRC).\n
 *            To transmit data less than 60 bytes, make sure to pad the data with zero to be 60 bytes.\n
 *            Return values indicate that the data written in the transmit buffer is enabled to be transmitted.\n
 *            ETHER_SUCCESS is returned when the data in the transmit buffer is enabled to transmit at the time
 *            of the call. When auto-negotiation is not completed, and transmission is not enabled,
 *            ETHER_ERR_LINK is returned. ETHER_ERR_MPDE is returned when a Magic Packet is being detected.
 *            The value ETHER_ERR_TACT is returned if there is no free space in the transmit buffer.
 * @note      1.To transmit data less than 60 bytes, make sure to pad the data with zero to be 60 bytes.\n
 *            2.As this function calls the R_ETHER_Write_ZC2_GetBuf() function and
 *              the R_ETHER_Write_ZC2_SetBuf() function internally, data is copied between the buffer pointed
 *              by the EDMAC transmit descriptor and the transmit buffer specified by the R_ETHER_Write() function.\n
 *            3.Make sure not to use the R_ETHER_Write_ZC2_GetBuf() function and R_ETHER_Write_ZC2_SetBuf()
 *              function when using the R_ETHER_Write() function.\n
 *            4.This function uses the standard functions memset and memcpy, so string.h is included.\n
 *            5.If the value ETHER_ERR_LINK is returned when this function is called,
 *              initialize the Ethernet FIT module.
 */
ether_return_t R_ETHER_Write(uint32_t channel, void *pbuf, const uint32_t len)
{
    ether_return_t ret;
    uint8_t * pwrite_buffer_address;
    uint16_t write_buf_size;

