renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((ETHER_BUFSIZE_MIN > len) || (ETHER_BUFSIZE_MAX < len))
    {
        return ETHER_ERR_INVALID_DATA;
    }

    /* (1) Retrieve the transmit buffer location controlled by the  descriptor. */
    ret = R_ETHER_Write_ZC2_GetBuf(channel, (void **) &pwrite_buffer_address, &write_buf_size);

    /* Writing to the transmit buffer (buf) is enabled. */
    if (ETHER_SUCCESS == ret)
    {
        if (write_buf_size < len)
        {
            ret = ETHER_ERR_TACT; /* Transmit buffer overflow */
        }
        else
        {
            /* Write the transmit data to the transmit buffer. */

            /* (2) Write the data to the transmit buffer controlled by the  descriptor. */
            memcpy(pwrite_buffer_address, pbuf, len);

            /* (3) Enable the EDMAC to transmit data in the transmit buffer. */
            ret = R_ETHER_Write_ZC2_SetBuf(channel, len);

            /* 
             * Confirm that the transmission is completed.
             * Data written in the transmit buffer is transmitted by the EDMAC. Make sure that the
             * transmission is completed after writing data to the transmit buffer.
             * If the R_ETHER_Close_ZC2 function is called to stop the Ethernet communication before
             * verifying that the transmission is completed, the written data written may not be transmitted.
             */
            ret = R_ETHER_CheckWrite(channel);
        }
    }
    return ret;
} /* End of function R_ETHER_Write() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_CheckWrite
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_CheckWrite() function verifies that data transmission has completed.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @details   The R_ETHER_CheckWrite() function verifies that data was transmitted.\n
 *            If the transmission completed, ETHER_SUCCESS is returned.
 * @note      1.This function should be called after transmit data has been written with
 *              the R_ETHER_Write_ZC2_Setbuf() function.\n
 *            2.Note that it takes several tens of microseconds for data transmission to actually complete after
 *              the R_ETHER_Write_ZC2_Setbuf() function is called. Therefore, when using the R_ETHER_Close_ZC2()
 *              function to shut down the Ethernet module following data transmission, call the R_ETHER_CheckWrite()
 *              function after calling the R_ETHER_Write_ZC2_Setbuf() function and, after waiting for
 *              data transmission to finish, call the R_ETHER_Close_ZC2() function. Calling the R_ETHER_Close_ZC2()
 *              function without calling the R_ETHER_CheckWrite() function can cause data transmission to be
 *              cut off before it completes.
 */
ether_return_t R_ETHER_CheckWrite(uint32_t channel)
{
    ether_return_t ret;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        ret = ETHER_ERR_INVALID_CHAN;
    }
    else
    {
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;
        /* WAIT_LOOP */
        while (0 != pedmac_adr->EDTRR.BIT.TR)
        {
            /* Do Nothing */
        }
        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_CheckWrite() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Control
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Control() function performs the processing that corresponds to the control code.
 * @param[in] cmd
 *             Specifies the control code.
 * @param[in] control
 *             Specify the parameters according to the control code.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully or the PMGI operation start normally when the non-blocking mode
 *              is enable.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_CHAN_OPEN
 *            - Indicates the Ethernet cannot be opened because it is being used by another application.
 * @retval    ETHER_ERR_INVALID_ARG
 *            - Invalid argument.
 * @retval    ETHER_ERR_RECV_ENABLE
 *            - ETHERC receive function enabled.
 * @details   Performs the processing that corresponds to the control code.
 *            The value ETHER_ERR_INVALID_ARG is returned if the control code is not supported.\n
 *            See section 3.14 in application note for more details.
 * @note      Register callback functions and interrupt handlers before calling the R_ETHER_Open_ZC2() function.
 *            It may not be possible to detect the first interrupt if the preceding are registered after
 *            the R_ETHER_Open_ZC2() function is called.\n
 *            Specify promiscuous mode after setting the control code to CONTROL_POWER_ON and calling this function.
 *            The intended value will not be stored in the ETHERC mode register if the promiscuous mode setting
 *            is specified without first setting the control code to CONTROL_POWER_ON and calling this function.\n
 *            Multicast frame filtering and broadcast frame filtering settings cannot be made while the receive
 *            functionality of the ETHERC is enabled. Make these settings before calling the R_ETHER_LinkProcess
 *            function. After the R_ETHER_LinkProcess function is called, the receive functionality is enabled
 *            when the Ethernet FIT module enters link up status, so calling this function with
 *            CONTROL_MULTICASTFRAME_FILTER or CONTROL_BROADCASTFRAME_FILTER set as the control code causes
 *            ETHER_ERR_RECV_ENABLE to be returned, and the settings have no effect.
 */
ether_return_t R_ETHER_Control(ether_cmd_t const cmd, ether_param_t const control)
{
    ether_return_t ret;

