renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    switch (cmd)
    {
        /* Set the callback function pointer */
        case CONTROL_SET_CALLBACK :
            ret = ether_set_callback(control);
            break;

        case CONTROL_SET_PROMISCUOUS_MODE :
            ret = ether_set_promiscuous_mode(control);
            break;

        case CONTROL_SET_INT_HANDLER :
            ret = ether_set_int_handler(control);
            break;

        case CONTROL_POWER_ON :
            ret = ether_power_on(control);
            break;

        case CONTROL_POWER_OFF :
            ret = ether_power_off(control);
            break;

        case CONTROL_MULTICASTFRAME_FILTER :
            ret = ether_set_multicastframe_filter(control);
            break;

        case CONTROL_BROADCASTFRAME_FILTER :
            ret = ether_set_broadcastframe_filter(control);
            break;

        case CONTROL_RECEIVE_DATA_PADDING :
            ret = ether_receive_data_padding(control);
            break;
#if (ETHER_CFG_NON_BLOCKING == 1)
        case CONTROL_SET_PMGI_CALLBACK :
            ret = ether_set_pmgi_callback(control);
            break;
#endif

        default :
            ret = ETHER_ERR_INVALID_ARG;
            break;
    }
    return ret;
} /* End of function R_ETHER_Control() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_WritePHY
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_WritePHY function uses the PHY management interface to write to registers in the PHY-LSI.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[in] address
 *             Specify the address of the PHY-LSI register to be accessed. For details,
 *             check the data sheet of the PHY-LSI to be used.
 * @param[in] data
 *             Specify the data to be written to the PHY-LSI register.
 *             For details, check the data sheet of the PHY-LSI to be used.
 * @retval    ETHER_SUCCESS
 *            - When access is completed normally or when the operation start normally when non-blocking mode is enabled.
 * @retval    ETHER_ERR_OTHER
 *            - When non-blocking mode is enabled and no interrupt handler function is registered.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_LOCKED
 *            - When non-blocking mode is enabled and PHY is being accessed.
 * @details   The R_ETHER_WritePHY function uses the PHY management interface to write access to registers in the PHY-LSI.
 *            If non-blocking mode is disabled, ETHER_SUCCESS is returned when write access is successfully completed.\n
 *            When non-blocking mode is enabled, the callback function is executed after the write access is completed.
 * @note      None
 */
ether_return_t R_ETHER_WritePHY(uint32_t channel, uint16_t address, uint16_t data)
{
#if (ETHER_CFG_NON_BLOCKING == 1)
    uint32_t pmgi_channel;
#endif
    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

#if (ETHER_CFG_NON_BLOCKING == 1)
    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return ETHER_ERR_OTHER;
    }

    pmgi_channel = get_pmgi_channel(channel);

    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE *)&g_phy_current_param[pmgi_channel].locked))
    {
        return ETHER_ERR_LOCKED;
    }

    set_ether_channel(channel);

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        return ETHER_ERR_OTHER;
    }

    g_phy_current_param[pmgi_channel].mode = WRITEPHY;
    g_phy_current_param[pmgi_channel].step = STEP0;

    pmgi_access(channel, address, data, PMGI_WRITE);

#elif (ETHER_CFG_NON_BLOCKING == 0)
    phy_write(channel, address, data);
#endif

    return ETHER_SUCCESS;
} /* End of function R_ETHER_WritePHY() */
/**********************************************************************************************************************
 * Function Name: R_ETHER_ReadPHY
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_ReadPHY function uses the PHY management interface to access to the registers in the PHY-LSI.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[in] address
 *             Specify the address of the PHY-LSI register to be accessed. For details,
 *             check the data sheet of the PHY-LSI to be used.
 * @param[out] *p_data
 *             Specify the pointer of the variable to store the register value read from PHY-LSI.
 *             For details, check the data sheet of the PHY-LSI to be used.
 * @retval    ETHER_SUCCESS
 *            - When access is completed normally or when the operation start normally when non-blocking mode is enabled.
 * @retval    ETHER_ERR_OTHER
 *            - When non-blocking mode is enabled and no interrupt handler function is registered.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_LOCKED
 *            - When non-blocking mode is enabled and PHY is being accessed.
 * @details   When non-blocking mode is disabled, the register value read from the PHY-LSI is stored in
 *            the argument p_data. Also, ETHER_SUCCESS is returned when the read access is successfully completed.\n
 *            When non-blocking mode is enabled, the read value is transferred as an argument of the callback function.\n
 * @note      None
 */
ether_return_t R_ETHER_ReadPHY(uint32_t channel, uint16_t address, uint16_t *p_data)
{
#if (ETHER_CFG_NON_BLOCKING == 1)
    uint32_t pmgi_channel;
#endif

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

#if (ETHER_CFG_NON_BLOCKING == 1)
    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return ETHER_ERR_OTHER;
    }

    pmgi_channel = get_pmgi_channel(channel);

