renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
 * Function Name: ether_set_multicastframe_filter
 * Description  : set multicast frame filtering function.
 * Arguments    : control -
 *                    Ethernet channel number and Multicast Frame filter enable switch
 * Return Value : ETHER_SUCCESS -
 *                    Processing completed successfully
 *                ETHER_ERR_INVALID_ARG -
 *                    Invalid argument
 *                ETHER_ERR_RECV_ENABLE -
 *                    Receive function is enable.
 ***********************************************************************************************************************/
static ether_return_t ether_set_multicastframe_filter(ether_param_t const control)
{
    ether_multicast_t * p_arg;
    uint32_t channel;
    ether_mc_filter_t flag;
    ether_return_t ret;
    uint32_t phy_access;

    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    const ether_control_t * pether_ch;

    ret = ETHER_ERR_INVALID_ARG;
    p_arg = control.p_ether_multicast;
    channel = p_arg->channel;
    flag = p_arg->flag;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ret;
    }
    if ((ETHER_MC_FILTER_ON != flag) && (ETHER_MC_FILTER_OFF != flag))
    {
        return ret;
    }

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;

    /* Check receive function is enable in ETHERC */
    if (0 == petherc_adr->ECMR.BIT.RE)
    {
        if (ETHER_MC_FILTER_ON == flag)
        {
            mc_filter_flag[channel] = ETHER_MC_FILTER_ON;
        }
        else
        {
            mc_filter_flag[channel] = ETHER_MC_FILTER_OFF;
        }

        ret = ETHER_SUCCESS;
    }
    else
    {
        ret = ETHER_ERR_RECV_ENABLE;
    }

    return ret;
} /* End of function ether_set_multicastframe_filter() */

/***********************************************************************************************************************
 * Function Name: ether_set_broadcastframe_filter
 * Description  : set broadcast frame filtering function.
 * Arguments    : control -
 *                    ETHERC channel number and receive count for continuous Broadcast Frame
 * Return Value : ETHER_SUCCESS -
 *                    Processing completed successfully
 *                ETHER_ERR_INVALID_ARG -
 *                    Invalid argument
 *                ETHER_ERR_RECV_ENABLE -
 *                    Receive function is enable.
 ***********************************************************************************************************************/
static ether_return_t ether_set_broadcastframe_filter(ether_param_t const control)
{
    ether_broadcast_t * p_arg;
    uint32_t channel;
    uint32_t counter;
    ether_return_t ret;
    uint32_t phy_access;

    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    const ether_control_t * pether_ch;

    ret = ETHER_ERR_INVALID_ARG;
    p_arg = control.p_ether_broadcast;
    channel = p_arg->channel;
    counter = p_arg->counter;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ret;
    }
    if (0 != (counter & 0x0FFFF0000))
    {
        return ret;
    }

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;

    /* Check receive function is enable in ETHERC */
    if (0 == petherc_adr->ECMR.BIT.RE)
    {
        bc_filter_count[channel] = counter;
        ret = ETHER_SUCCESS;
    }
    else
    {
        ret = ETHER_ERR_RECV_ENABLE;
    }

    return ret;
} /* End of function ether_set_broadcastframe_filter() */

/***********************************************************************************************************************
 * Function Name: power_on_control
 * Description  : Powers on the channel if the ETHEC channel used and the PHY access channel are different, or if the 
 *                PHY access channel is powered off.
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : ETHER_SUCCESS -
 *                    Processing completed successfully
 *                ETHER_ERR_INVALID_CHAN -
 *                    Nonexistent channel number
 *                ETHER_ERR_CHAN_OPEN -
 *                    Indicates the Ethernet cannot be opened because it is being used by another application
 *              : ETHER_ERR_OTHER -
 *                    
 ***********************************************************************************************************************/
static ether_return_t power_on_control(uint32_t channel)
{
#if (ETHER_CHANNEL_MAX == 1)
    ether_return_t ret = ETHER_ERR_OTHER;

    etherc_edmac_power_cont[ether_phy_access[channel]][channel] = ETHER_MODULE_USE;

    ret = power_on(channel);

    return ret;

#elif ETHER_CHANNEL_MAX == 2
    ether_return_t ret = ETHER_ERR_OTHER;

    etherc_edmac_power_cont[ether_phy_access[channel]] [channel] = ETHER_MODULE_USE;

    if (channel != ether_phy_access[channel])
    {
        ret = power_on(channel);
        if (ETHER_SUCCESS != ret)
        {
            return ret;
        }
    }

    if (!(( ETHER_MODULE_USE == etherc_edmac_power_cont[ether_phy_access[channel]] [ETHER_CHANNEL_0] ) &&
                    ( ETHER_MODULE_USE == etherc_edmac_power_cont[ether_phy_access[channel]] [ETHER_CHANNEL_1] )))
    {
        ret = power_on(ether_phy_access[channel]);
    }

    return ret;

#endif
} /* End of function power_on_control() */

/***********************************************************************************************************************
 * Function Name: power_off_control
 * Description  : Powers off the channel if the ETHEC channel used and the PHY access channel are different, or if the 
 *                PHY access channel is powered off.
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : none
 ***********************************************************************************************************************/
static void power_off_control(uint32_t channel)
{
#if (ETHER_CHANNEL_MAX == 1)
    etherc_edmac_power_cont[ether_phy_access[channel]][channel] = ETEHR_MODULE_NOT_USE;

