renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    power_off(channel);

#elif (ETHER_CHANNEL_MAX == 2)
    etherc_edmac_power_cont[ether_phy_access[channel]] [channel] = ETEHR_MODULE_NOT_USE;

    if (channel != ether_phy_access[channel])
    {
        power_off(channel);
    }

    if (( ETEHR_MODULE_NOT_USE == etherc_edmac_power_cont[ether_phy_access[channel]] [ETHER_CHANNEL_0] ) &&
            ( ETEHR_MODULE_NOT_USE == etherc_edmac_power_cont[ether_phy_access[channel]] [ETHER_CHANNEL_1] ))
    {
        power_off(ether_phy_access[channel]);
    }
#endif
} /* End of function power_off_control() */

/***********************************************************************************************************************
 * Function Name: check_mpde_bit
 * Description  : 
 * Arguments    : none
 * Return Value : 1: Magic Packet detection is enabled.
 *                0: Magic Packet detection is disabled.
 ***********************************************************************************************************************/
static uint8_t check_mpde_bit(void)
{
#if (ETHER_CHANNEL_MAX == 1)
    /* The MPDE bit can be referred to only when ETHERC operates. */
    if ((ETHER_MODULE_USE == etherc_edmac_power_cont[ETHER_PHY_ACCESS_CHANNEL_0][ETHER_CHANNEL_0])
            && (1 == ETHERC0.ECMR.BIT.MPDE))
    {
        return 1;
    }
    else
    {
        return 0;
    }
#elif (ETHER_CHANNEL_MAX == 2)
    /* The MPDE bit can be referred to only when ETHERC0 operates. */
    if ( ( ((ETHER_MODULE_USE == etherc_edmac_power_cont[ETHER_PHY_ACCESS_CHANNEL_0] [ETHER_CHANNEL_0])
            || (ETHER_MODULE_USE == etherc_edmac_power_cont[ETHER_PHY_ACCESS_CHANNEL_1] [ETHER_CHANNEL_0]))
            && (1 == ETHERC0.ECMR.BIT.MPDE)
            )

            /* The MPDE bit can be referred to only when ETHERC1 operates. */
            || ( ((ETHER_MODULE_USE == etherc_edmac_power_cont[ETHER_PHY_ACCESS_CHANNEL_0] [ETHER_CHANNEL_1])
            || (ETHER_MODULE_USE == etherc_edmac_power_cont[ETHER_PHY_ACCESS_CHANNEL_1] [ETHER_CHANNEL_1]))
            && (1 == ETHERC1.ECMR.BIT.MPDE)
            )
    )
    {
        return 1;
    }
    else
    {
        return 0;
    }
#endif
} /* End of function check_mpde_bit() */

#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || \
        defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N))
/***********************************************************************************************************************
 * Function Name: ether_eint0
 * Description  : EINT0 interrupt processing (A callback function to be called from r_bsp.)
 * Arguments    : pparam -
 *                    unused
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_eint0(void * pparam)
{
    volatile uint32_t dummy;

    ether_int_common(ETHER_CHANNEL_0);

    dummy = (uint32_t) pparam;
} /* End of function ether_eint0() */
#endif

#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N))
/***********************************************************************************************************************
 * Function Name: ether_eint1
 * Description  : EINT1 interrupt processing (A callback function to be called from r_bsp.)
 * Arguments    : pparam -
 *                    unused
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_eint1(void * pparam)
{
    volatile uint32_t dummy;

    ether_int_common(ETHER_CHANNEL_1);

    dummy = (uint32_t)pparam;
} /* End of function ether_eint1() */
#endif

/***********************************************************************************************************************
 * Function Name: ether_int_common
 * Description  : Interrupt handler for Ethernet receive and transmit interrupts.
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_int_common(uint32_t channel)
{
    uint32_t status_ecsr;
    uint32_t status_eesr;
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
    ether_cb_arg_t cb_arg;

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;

    status_ecsr = petherc_adr->ECSR.LONG;
    status_eesr = pedmac_adr->EESR.LONG;

    /* Callback : Interrupt handler */
    if ((NULL != cb_func.pcb_int_hnd) && (FIT_NO_FUNC != cb_func.pcb_int_hnd))
    {
        cb_arg.channel = channel;
        cb_arg.status_ecsr = status_ecsr;
        cb_arg.status_eesr = status_eesr;
        (*cb_func.pcb_int_hnd)((void *) &cb_arg);
    }

    /* When the ETHERC status interrupt is generated */
    if (status_eesr & EMAC_ECI_INT)
    {
#if (ETHER_CFG_USE_LINKSTA == 1)
        /* When the link signal change interrupt is generated */
        if (EMAC_LCHNG_INT == (status_ecsr & EMAC_LCHNG_INT))
        {
            /* The state of the link signal is confirmed and Link Up/Down is judged. */
            /* When becoming Link up */
            if (ETHER_CFG_LINK_PRESENT == petherc_adr->PSR.BIT.LMON)
            {
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
            }

            /* When Link becomes down */
            else
            {
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_OFF;
            }
        }
#endif

        /* When the Magic Packet detection interrupt is generated */
        if (EMAC_MPD_INT == (status_ecsr & EMAC_MPD_INT))
        {
            mpd_flag[channel] = ETHER_FLAG_ON;
        }

