renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
        /*
         * Because each bit of the ECSR register is cleared when one is written, 
         * the value read from the register is written and the bit is cleared. 
         */
        /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
        petherc_adr->ECSR.LONG = status_ecsr;
    }

    /*
     * Because each bit of the EESR register is cleared when one is written, 
     * the value read from the register is written and the bit is cleared. 
     */
    pedmac_adr->EESR.LONG = status_eesr; /* Clear EDMAC status bits */

    /* Whether it is a necessary code is confirmed. */

} /* End of function ether_int_common() */

/***********************************************************************************************************************
 * Function Name: ether_receive_data_padding
 * Description  : Save the receive data padding information.
 * Arguments    : control -
 *                    Receive data padding information
 * Return Value : ETHER_SUCCESS -
 *                    Processing completed successfully
 *                ETHER_ERR_INVALID_ARG -
 *                    Invalid argument
 ***********************************************************************************************************************/
static ether_return_t ether_receive_data_padding(ether_param_t const control)
{
    ether_recv_padding_t *  p_arg;
    uint32_t                channel;
    uint8_t                 position;
    uint8_t                 size;

    p_arg      = control.padding_param;
    channel     = p_arg->channel;
    position    = p_arg->position;
    size        = p_arg->size;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_ARG;    // ETHERC channel invalid
    }

    if (INSERT_POSITION_MAX < position )
    {
        return ETHER_ERR_INVALID_ARG;    // Insert position out the range
    }

    if (INSERT_SIZE_MAX < size )
    {
        return ETHER_ERR_INVALID_ARG;    // Insert size beyond the MAX size
    }

    /* save insert information */
    padding_insert_position[channel] = position;
    padding_insert_size[channel] = size;

    return ETHER_SUCCESS;
} /* End of function ether_receive_data_padding() */

#if (ETHER_CFG_NON_BLOCKING == 1)
/***********************************************************************************************************************
 * Function Name: ether_set_pmgi_callback
 * Description  : Set the callback function
 * Arguments    : control -
 *                    Callback function pointer.
 *                    If you would rather poll for finish then please input FIT_NO_FUNC for this argument.
 * Return Value : ETHER_SUCCESS
 *                    Processing completed successfully
 ***********************************************************************************************************************/
static ether_return_t ether_set_pmgi_callback(ether_param_t const control)
{
    void (*pcb_func) (void *);

    pcb_func = control.pmgi_callback.pcb_pmgi_hnd;

    /* Check callback function pointer, of whether or NULL FIT_NO_FUNC */
    if ((NULL != pcb_func) && (FIT_NO_FUNC != pcb_func))
    {
        cb_func.pcb_pmgi_hnd = pcb_func; /* Set the callback function */
    }

    return ETHER_SUCCESS;
} /* End of function ether_set_pmgi_callback() */

/***********************************************************************************************************************
 * Function Name: get_pmgi_channel
 * Description  : Calculate the PMGI channel number from used ETHERC channel
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : Used PMGI channel number
 ***********************************************************************************************************************/
static uint16_t get_pmgi_channel(uint32_t channel)
{
    uint16_t pmgi_channel;

    if (ETHER_CHANNEL_0 == channel)
    {
        pmgi_channel = ETHER_CFG_CH0_PHY_ACCESS;
    }
    else
    {
        pmgi_channel = ETHER_CFG_CH1_PHY_ACCESS;
    }

    return pmgi_channel;
} /* End of function get_pmgi_channel() */

/***********************************************************************************************************************
 * Function Name: set_ether_channel
 * Description  : Save the ETHERC channel number
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : None
 ***********************************************************************************************************************/
static void set_ether_channel(uint32_t channel)
{
    if (ETHER_CHANNEL_0 == channel)
    {
        g_phy_current_param[ETHER_CFG_CH0_PHY_ACCESS].ether_channel = channel;
    }
    else
    {
        g_phy_current_param[ETHER_CFG_CH1_PHY_ACCESS].ether_channel = channel;
    }
} /* End of function set_ether_channel() */

#if (ETHER_CFG_CH0_PHY_ACCESS == 0) || (ETHER_CFG_CH1_PHY_ACCESS == 0)
/******************************************************************************
* Function Name:    ether_pmgi0i_isr
* Description  :    PMGI0 complete ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(ether_pmgi0i_isr, VECT_PMGI0_PMGI0I)
R_BSP_ATTRIB_STATIC_INTERRUPT void ether_pmgi0i_isr(void)
{
    pmgi_cb_arg_t           cb_arg;
    pmgi_mode_t             mode;
    uint32_t                ether_channel;
    pmgi_step_t             step;
    pmgi_event_t            event;

    mode            = g_phy_current_param[PMGI_CHANNEL_0].mode;
    step            = g_phy_current_param[PMGI_CHANNEL_0].step;
    ether_channel   = g_phy_current_param[PMGI_CHANNEL_0].ether_channel;

    if (PmgiAccessFun_tbl[mode][step].p_func(ether_channel) != ETHER_SUCCESS)
    {
        g_phy_current_param[PMGI_CHANNEL_0].event = PMGI_ERROR;
    }

    event = g_phy_current_param[PMGI_CHANNEL_0].event;
    if ((PMGI_COMPLETE == event) || (PMGI_ERROR == event))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[PMGI_CHANNEL_0].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            if (PMGI_COMPLETE == event)
            {
                cb_arg.event = PMGI_COMPLETE;
                cb_arg.mode = g_phy_current_param[PMGI_CHANNEL_0].mode;
            }
            else
            {
                cb_arg.event = PMGI_ERROR;
                cb_arg.mode = g_phy_current_param[PMGI_CHANNEL_0].mode;
            }
            cb_arg.channel = ether_channel;
            cb_arg.reg_data = g_phy_current_param[PMGI_CHANNEL_0].read_data;
            /* set PMGI parameters to default */
            g_phy_current_param[PMGI_CHANNEL_0].event = PMGI_IDLE;
            g_phy_current_param[PMGI_CHANNEL_0].mode = OPEN_ZC2;
            g_phy_current_param[PMGI_CHANNEL_0].step = STEP0;
            pmgi_close(PMGI_CHANNEL_0);
            (*cb_func.pcb_pmgi_hnd)((void *)&cb_arg);
        }
    }
    else
    {

