renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/******************************************************************************
* Function Name:    pmgi_open_zc2_step3
* Description  :    Processing after R_ETHER_Open_ZC2'step3 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step3(uint32_t channel)
{
    ether_return_t              ret = ETHER_SUCCESS;
    uint16_t                    pmgi_channel;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP4;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    if (ETHER_FLAG_OFF == pause_frame_enable[channel])
    {
        local_advertise[channel] = ((((PHY_AN_ADVERTISEMENT_100F |
        PHY_AN_ADVERTISEMENT_100H) |
        PHY_AN_ADVERTISEMENT_10F) |
        PHY_AN_ADVERTISEMENT_10H) |
        PHY_AN_ADVERTISEMENT_SELECTOR);
    }

    /* When pause frame is used */
    else
    {
        local_advertise[channel] = ((((((PHY_AN_ADVERTISEMENT_ASM_DIR |
        PHY_AN_ADVERTISEMENT_PAUSE) |
        PHY_AN_ADVERTISEMENT_100F) |
        PHY_AN_ADVERTISEMENT_100H) |
        PHY_AN_ADVERTISEMENT_10F) |
        PHY_AN_ADVERTISEMENT_10H) |
        PHY_AN_ADVERTISEMENT_SELECTOR);
    }

    pmgi_access(channel, PHY_REG_AN_ADVERTISEMENT, local_advertise[channel], PMGI_WRITE);

    return ret;
} /* End of function pmgi_open_zc2_step3() */

#elif ETHER_CFG_USE_PHY_KSZ8041NL == 0
static ether_return_t pmgi_open_zc2_step2(uint32_t channel)
{
    return ETHER_ERR_OTHER;
}

static ether_return_t pmgi_open_zc2_step3(uint32_t channel)
{
    return ETHER_ERR_OTHER;
}
#endif

/******************************************************************************
* Function Name:    pmgi_open_zc2_step4
* Description  :    Processing after R_ETHER_Open_ZC2'step4 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step4(uint32_t channel)
{
    ether_return_t          ret = ETHER_SUCCESS;
    uint16_t                pmgi_channel;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP5;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_CONTROL, (PHY_CONTROL_AN_ENABLE |
            PHY_CONTROL_AN_RESTART), PMGI_WRITE);

    return ret;
} /* End of function pmgi_open_zc2_step4() */

/******************************************************************************
* Function Name:    pmgi_open_zc2_step5
* Description  :    Processing after R_ETHER_Open_ZC2'step5 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step5(uint32_t channel)
{
    ether_return_t          ret = ETHER_SUCCESS;
    uint16_t                pmgi_channel;
    uint16_t                data = 0;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP6;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_AN_ADVERTISEMENT, data, PMGI_READ);

    return ret;
} /* End of function pmgi_open_zc2_step5() */

/******************************************************************************
* Function Name:    pmgi_open_zc2_step6
* Description  :    Processing after R_ETHER_Open_ZC2'step6 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step6(uint32_t channel)
{
    ether_return_t              ret = ETHER_SUCCESS;
    uint16_t                    pmgi_channel;
    uint16_t                    reg;
    const ether_control_t *     pether_ch;
    uint32_t                    phy_access;

    volatile struct st_etherc R_BSP_EVENACCESS_SFR *    petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR *     pedmac_adr;

    pmgi_channel = get_pmgi_channel(channel);
    reg = pmgi_read_reg(pmgi_channel);

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;


    /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
    petherc_adr->ECSR.LONG = 0x00000037;

    /* Clear all EDMAC status bits */
    pedmac_adr->EESR.LONG = 0x47FF0F9F;

#if (ETHER_CFG_USE_LINKSTA == 1)
    /* Enable interrupts of interest only. */
    petherc_adr->ECSIPR.BIT.LCHNGIP = 1;
#endif

    pedmac_adr->EESIPR.BIT.ECIIP = 1;

    /* Set Ethernet interrupt level and enable */
    ether_enable_icu(channel);

    if (LINKPROCESS_OPEN_ZC2 == g_phy_current_param[pmgi_channel].mode)
    {
#if (ETHER_CFG_USE_LINKSTA == 0)
        /* set the current parameter of phy */
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC0;
        g_phy_current_param[pmgi_channel].step = STEP0;
        g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

        pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

